%   y' = f(x, y)    f: U -> R   U <= R^2
%   y(x0) = y0
%   J < R e интервал
%   g: J -> R е непрк. и диференцируема
%   Казваме, че g е eps приближено решение на задачата на Коши, ако:
%       (x, g(x)) е от U, за х от J
%       |g'(x) - f(x, g(x))| < eps , за х от J
%
%   Th. Ако f: U-> R e непркъсната ограничена функция в 
%       U = [a, b]x[y0 - r, y0 + r] и |f(x, y)| <= M върху U, то
%       за всяко х0 от [a, b], eps > 0, съществува eps приближено решение
%       на зад. на Коши в сечението на [a, b] с [x0 - r/M, x0 + r/M]
%
%   y = y0 + f(x0, y0)*(x - x0)         
%   g0(x) = y0 + f(x0, y0)*(x - x0)     x0 <= x <= x1
%   g0'(x) = f(x0, y0)
% |g0'(x) - f(x, g0(x))| = |f(x0, y0) - f(x, y0 + f(x0, y0)*(x - x0)| < eps
%   g1(x) = y1 + f(x1, y1)*(x - x1)     x1 <= x <= x2   и т. н.
%   ъъъ..
%
%   Задача: Да се реши символно задачата на Коши y' = -y*tg(x) + cos(2*x)
%                                                y(0) = 1
%       И да се начертае графиките на приближенията на решението получени
%       по метода на Ойлер със задедени стъпки h1 = 0.5, h2 = 0.2, h3 = 0.1
%

function EulersMethod % не баца нещо..
    x0 = 0;
    y0 = 1;
    xmax = 2;
    
    yy = dsolve('Dy=-y*tan(x)+cos(x^2','y(0)=1','x');
    s = x0:(xmax - x0)/100:xmax;
    z = subs(yy, 'x', s);
        
    plot(s, z, 'k');
    grid on;
    hold on;
    xlabel('x');
    ylabel('y');

    h = [0.5, 0.2, 0.1];
    x(1) = x0; 
    y(1) = y0;
    
    for k=1:length(h)
        x = x0:h(k):xmax;
        for j=1:length(h)-1
            y(j+1) = y(j) + h(k)*(cos(x(j))^2 - y(j)*tan(x(j)));
        end
        plot(x, y)
    end
end








